performance/perfGetFormTest.yml
config:
  target: '{{ $processEnvironment.FORM_API_SERVER_URL }}'
  phases:
    - duration: 120
      arrivalRate: 100
scenarios:
  - name: 'Get all forms'
    flow:
      - log: "Get a specific form"
      - get:
          url: "/form/b3e38f87-a7f3-42ea-8893-a6bf2115b647"
          headers:
            Authorization: "Bearer {{ $processEnvironment.ACCESS_TOKEN }}"