performance/perfGetFormTest.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 100
scenarios:
  - name: 'Get all forms'
    flow:
      - log: "Get access token"
      - post:
          url: "http://192.168.86.22:8080/auth/realms/elf/protocol/openid-connect/token"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          form:
            username: "{{ $processEnvironment.USERNAME }}"
            password: "{{ $processEnvironment.PASSWORD }}"
            grant_type: "password"
            client_id: "www"
          capture:
            json: "$.access_token"
            as: "accessToken"

      - log: "Get a specific form"
      - get:
          url: "/form/9c4c1fe4-4cc4-4d33-8243-9bcc7e9bc196"
          headers:
            Authorization: "Bearer {{ accessToken }}"