performance/perfTest.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 20
  defaults:
    headers:
      Authorization: 'Bearer {{ $processEnvironment.BEARER_TOKEN }}'
scenarios:
  - name: 'Get form by id'
    flow:
      - post:
          - url:
      - get:
          url: "/form/122383f4-95e5-4954-a9e1-f0a55377ebee"