performance/perfTest.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 20
  defaults:
    headers:
      Authorization: 'Bearer {{ $processEnvironment.BEARER_TOKEN }}'
scenarios:
  - name: 'Get form by id'
    flow:
      - get:
          url: "/form/f91e96d8-91f3-4bb0-bde8-dcc0b5e2b9da"