performance/perfTest.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 100
scenarios:
  - name: 'Create, get and update form'
    flow:
      - log: "Get access token"
      - post:
          url: "http://192.168.86.22:8080/auth/realms/elf/protocol/openid-connect/token"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          form:
            username: "{{ $processEnvironment.USERNAME }}"
            password: "{{ $processEnvironment.PASSWORD }}"
            grant_type: "password"
            client_id: "www"
          capture:
            json: "$.access_token"
            as: "accessToken"
      - think: 1

      - log: "Posting new form"
      - post:
          url: "/form"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          capture:
            - header: "location"
              as: "formId"
          json:
            "type": "form"
            "components": [
                  {
                    "label": "Text Field",
                    "widget": {
                      "type": "input"
                    },
                    "tableView": true,
                    "inputFormat": "plain",
                    "validate": {
                      "required": true
                    },
                    "key": "textField",
                    "type": "textfield",
                    "input": true
                  },
                  {
                    "type": "button",
                    "label": "Submit",
                    "key": "submit",
                    "disableOnInvalid": true,
                    "input": true,
                    "tableView": false
                  }
            ]
            "title": "{{ $randomString() }}"
            "path": "{{ $randomString() }}"
            "display": "form"
            "name": "{{ $randomString() }}"
            "submissionAccess": []
            "access": []

      - think: 1
      - log: "Getting form that was posted"
      - get:
          url: "{{ formId }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"
      - log: "Updating the form"
      - think: 1

      - put:
          url: "{{ formId }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            "type": "form"
            "components": [
              {
                "label": "Text Field",
                "widget": {
                  "type": "input"
                },
                "tableView": true,
                "inputFormat": "plain",
                "validate": {
                  "required": true
                },
                "key": "textField",
                "type": "textfield",
                "input": true
              },
              {
                "label": "Text Field",
                "widget": {
                  "type": "input"
                },
                "tableView": true,
                "inputFormat": "plain",
                "validate": {
                  "required": true
                },
                "key": "textField2",
                "type": "textfield",
                "input": true
              },
              {
                "type": "button",
                "label": "Submit",
                "key": "submit",
                "disableOnInvalid": true,
                "input": true,
                "tableView": false
              }
            ]
            "title": "{{ $randomString() }}"
            "path": "{{ $randomString() }}"
            "display": "form"
            "name": "{{ $randomString() }}"
            "submissionAccess": []
            "access": []